nxp-mcuxpresso/mcux-soc-svd/MCXA287/MCXA287.xml
        <register>
          <name>TIMER2TRIG</name>
          <description>Trigger register for TIMER2 inputs</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INP</name>
              <description>Input number for CTIMER2 trigger</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>val1</name>
                  <description>CT_INP0 input is selected</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val2</name>
                  <description>CT_INP1 input is selected</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val3</name>
                  <description>CT_INP2 input is selected</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val4</name>
                  <description>CT_INP3 input is selected</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val5</name>
                  <description>CT_INP4 input is selected</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val6</name>
                  <description>CT_INP5 input is selected</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val7</name>
                  <description>CT_INP6 input is selected</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val8</name>
                  <description>CT_INP7 input is selected</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val9</name>
                  <description>CT_INP8 input is selected</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val10</name>
                  <description>CT_INP9 input is selected</description>
                  <value>0xA</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val11</name>
                  <description>CT_INP10 input is selected</description>
                  <value>0xB</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val12</name>
                  <description>CT_INP11 input is selected</description>
                  <value>0xC</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val13</name>
                  <description>CT_INP12 input is selected</description>
                  <value>0xD</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val14</name>
                  <description>CT_INP13 input is selected</description>
                  <value>0xE</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val15</name>
                  <description>CT_INP14 input is selected</description>
                  <value>0xF</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val16</name>
                  <description>CT_INP15 input is selected</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val17</name>
                  <description>CT_INP16 input is selected</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val18</name>
                  <description>CT_INP17 input is selected</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val19</name>
                  <description>CT_INP18 input is selected</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val20</name>
                  <description>CT_INP19 input is selected</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val22</name>
                  <description>AOI0_OUT0 input is selected</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val23</name>
                  <description>AOI0_OUT1 input is selected</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val24</name>
                  <description>AOI0_OUT2 input is selected</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val25</name>
                  <description>AOI0_OUT3 input is selected</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val26</name>
                  <description>ADC0_tcomp[0]</description>
                  <value>0x1A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val27</name>
                  <description>ADC0_tcomp[1]</description>
                  <value>0x1B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val28</name>
                  <description>ADC0_tcomp[2]</description>
                  <value>0x1C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val29</name>
                  <description>ADC0_tcomp[3] input is selected</description>
                  <value>0x1D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val30</name>
                  <description>CMP0_OUT is selected</description>
                  <value>0x1E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val33</name>
                  <description>CTimer0_MAT1 input is selected</description>
                  <value>0x21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val34</name>
                  <description>CTimer0_MAT2 input is selected</description>
                  <value>0x22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val35</name>
                  <description>CTimer0_MAT3 input is selected</description>
                  <value>0x23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val36</name>
                  <description>CTimer1_MAT1 input is selected</description>
                  <value>0x24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val37</name>
                  <description>CTimer1_MAT2 input is selected</description>
                  <value>0x25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val38</name>
                  <description>CTimer1_MAT3 input is selected</description>
                  <value>0x26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val48</name>
                  <description>LPI2C0 Master End of Packet input is selected</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val49</name>
                  <description>LPI2C0 Slave End of Packet input is selected</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val50</name>
                  <description>LPI2C1 Master End of Packet input is selected</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val51</name>
                  <description>LPI2C1 Slave End of Packet input is selected</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val52</name>
                  <description>LPSPI0 End of Frame input is selected</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val53</name>
                  <description>LPSPI0 Received Data Word input is selected</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val54</name>
                  <description>LPSPI1 End of Frame input is selected</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val55</name>
                  <description>LPSPI1 Received Data Word input is selected</description>
                  <value>0x37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val56</name>
                  <description>LPUART0 Received Data Word input is selected</description>
                  <value>0x38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val57</name>
                  <description>LPUART0 Transmitted Data Word input is selected</description>
                  <value>0x39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val58</name>
                  <description>LPUART0 Receive Line Idle input is selected</description>
                  <value>0x3A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val59</name>
                  <description>LPUART1 Received Data Word input is selected</description>
                  <value>0x3B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val60</name>
                  <description>LPUART1 Transmitted Data Word input is selected</description>
                  <value>0x3C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val61</name>
                  <description>LPUART1 Receive Line Idle input is selected</description>
                  <value>0x3D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val62</name>
                  <description>LPUART2 Received Data Word input is selected</description>
                  <value>0x3E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val63</name>
                  <description>LPUART2 Transmitted Data Word input is selected</description>
                  <value>0x3F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val64</name>
                  <description>LPUART2 Receive Line Idle input is selected</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val65</name>
                  <description>LPUART3 Received Data Word input is selected</description>
                  <value>0x41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val66</name>
                  <description>LPUART3 Transmitted Data Word input is selected</description>
                  <value>0x42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val67</name>
                  <description>LPUART3 Receive Line Idle input is selected</description>
                  <value>0x43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val68</name>
                  <description>LPUART4 Received Data Word input is selected</description>
                  <value>0x44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val69</name>
                  <description>LPUART4 Transmitted Data Word input is selected</description>
                  <value>0x45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val70</name>
                  <description>LPUART4 Receive Line Idle input is selected</description>
                  <value>0x46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val75</name>
                  <description>ADC1_tcomp[0] input is selected</description>
                  <value>0x4B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val76</name>
                  <description>ADC1_tcomp[1] input is selected</description>
                  <value>0x4C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val77</name>
                  <description>ADC1_tcomp[2] input is selected</description>
                  <value>0x4D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val78</name>
                  <description>ADC1_tcomp[3] input is selected</description>
                  <value>0x4E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val79</name>
                  <description>CTimer3_MAT1 input is selected</description>
                  <value>0x4F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val80</name>
                  <description>CTimer3_MAT2 is selected</description>
                  <value>0x50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val81</name>
                  <description>CTimer3_MAT3 input is selected</description>
                  <value>0x51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val82</name>
                  <description>CTimer4_MAT1 input is selected</description>
                  <value>0x52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val83</name>
                  <description>CTimer4_MAT2 input is selected</description>
                  <value>0x53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val84</name>
                  <description>CTimer4_MAT3 input is selected</description>
                  <value>0x54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val94</name>
                  <description>LPI2C2 Master End of Packet input is selected</description>
                  <value>0x5E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val95</name>
                  <description>LPI2C2 Slave End of Packet input is selected</description>
                  <value>0x5F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val96</name>
                  <description>LPI2C3 Master End of Packet input is selected</description>
                  <value>0x60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val97</name>
                  <description>LPI2C3 Slave End of Packet input is selected</description>
                  <value>0x61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val98</name>
                  <description>LPUART5 Received Data Word input is selected</description>
                  <value>0x62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val99</name>
                  <description>LPUART5 Transmitted Data Word input is selected</description>
                  <value>0x63</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val100</name>
                  <description>LPUART5 Receive Line Idle input is selected</description>
                  <value>0x64</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val113</name>
                  <description>TRIG_IN0 input is selected</description>
                  <value>0x71</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val114</name>
                  <description>TRIG_IN1 input is selected</description>
                  <value>0x72</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val115</name>
                  <description>TRIG_IN2 input is selected</description>
                  <value>0x73</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val116</name>
                  <description>TRIG_IN3 input is selected</description>
                  <value>0x74</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val117</name>
                  <description>TRIG_IN4 input is selected</description>
                  <value>0x75</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val118</name>
                  <description>TRIG_IN5 input is selected</description>
                  <value>0x76</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val119</name>
                  <description>TRIG_IN6 input is selected</description>
                  <value>0x77</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val120</name>
                  <description>TRIG_IN7 input is selected</description>
                  <value>0x78</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val121</name>
                  <description>TRIG_IN8 input is selected</description>
                  <value>0x79</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val122</name>
                  <description>TRIG_IN9 input is selected</description>
                  <value>0x7A</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val123</name>
                  <description>TRIG_IN10 input is selected</description>
                  <value>0x7B</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val124</name>
                  <description>TRIG_IN11 input is selected</description>
                  <value>0x7C</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val125</name>
                  <description>USB1 Start of Frame input is selected</description>
                  <value>0x7D</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val126</name>
                  <description>LPSPI2 End of Frame is selected</description>
                  <value>0x7E</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val127</name>
                  <description>LPSPI2 Received Data Word input is selected</description>
                  <value>0x7F</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val128</name>
                  <description>LPSPI3 End of Frame input is selected</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val129</name>
                  <description>LPSPI3 Received Data Word input is selected</description>
                  <value>0x81</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val130</name>
                  <description>LPSPI4 End of Frame input is selected</description>
                  <value>0x82</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val131</name>
                  <description>LPSPI4 Received Data Word input is selected</description>
                  <value>0x83</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val132</name>
                  <description>LPSPI5 End of Frame input is selected</description>
                  <value>0x84</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>val133</name>
                  <description>LPSPI5 Received Data Word input is selected</description>
                  <value>0x85</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
