nxp-mcuxpresso/mcux-soc-svd/MCXA287/MCXA287.xml
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF29</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF30</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ISF31</name>
              <description>Interrupt Status Flag</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <modifiedWriteValues>oneToClear</modifiedWriteValues>
              <enumeratedValues>
                <usage>read</usage>
                <enumeratedValue>
                  <name>isf0</name>
                  <description>Not detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>isf1</name>
                  <description>Detected</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO1</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <baseAddress>0x4004A000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO1</name>
        <value>72</value>
      </interrupt>
      <interrupt>
        <name>GPIO1_1</name>
        <value>127</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO2</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <baseAddress>0x4004C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO2</name>
        <value>73</value>
      </interrupt>
      <interrupt>
        <name>GPIO2_1</name>
        <value>128</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO3</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <baseAddress>0x4004E000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO3</name>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>GPIO3_1</name>
        <value>129</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO4</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <baseAddress>0x40050000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO4</name>
        <value>75</value>
      </interrupt>
      <interrupt>
        <name>GPIO4_1</name>
        <value>130</value>
      </interrupt>
    </peripheral>
    <peripheral derivedFrom="GPIO0">
      <name>GPIO5</name>
      <description>GPIO</description>
      <groupName>RGPIO</groupName>
      <baseAddress>0x400DF000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x128</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>GPIO5</name>
        <value>76</value>
      </interrupt>
      <interrupt>
        <name>GPIO5_1</name>
        <value>131</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>DMA0</name>
      <description>DMA MP</description>
      <groupName>DMA</groupName>
      <baseAddress>0x40080000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x130</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>DMA0_CH0</name>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH1</name>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH2</name>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH3</name>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH4</name>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH5</name>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH6</name>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH7</name>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH8</name>
        <value>134</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH9</name>
        <value>135</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH10</name>
        <value>136</value>
      </interrupt>
      <interrupt>
        <name>DMA0_CH11</name>
        <value>137</value>
      </interrupt>
      <registers>
        <register>
          <name>MP_CSR</name>
          <description>Management Page Control</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x310000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EDBG</name>
              <description>Enable Debug</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Debug mode disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Debug mode is enabled.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERCA</name>
              <description>Enable Round Robin Channel Arbitration</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Round-robin channel arbitration disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLE</name>
                  <description>Round-robin channel arbitration enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HAE</name>
              <description>Halt After Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALT</name>
                  <description>Any error causes the HALT field to be set to 1</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HALT</name>
              <description>Halt DMA Operations</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STALL</name>
                  <description>Stall the start of any new channels</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GCLC</name>
              <description>Global Channel Linking Control</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Channel linking disabled for all channels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Channel linking available and controlled by each channel's link settings</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GMRC</name>
              <description>Global Initiator ID Replication Control</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Initiator ID replication disabled for all channels</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVAILABLE</name>
                  <description>Initiator ID replication available and controlled by each channel's CHn_SBR[EMI] setting</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECX</name>
              <description>Cancel Transfer With Error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANCEL</name>
                  <description>Cancel the remaining data transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CX</name>
              <description>Cancel Transfer</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL_OPERATION</name>
                  <description>Normal operation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA_TRANSFER_CANCEL</name>
                  <description>Cancel the remaining data transfer</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACTIVE_ID</name>
              <description>Active Channel ID</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTIVE</name>
              <description>DMA Active Status</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>eDMA is idle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EXECUTION</name>
                  <description>eDMA is executing a channel</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_ES</name>
          <description>Management Page Error Status</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBE</name>
              <description>Destination Bus Error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No destination bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_ERROR</name>
                  <description>Last recorded error was a bus error on a destination write</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SBE</name>
              <description>Source Bus Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No source bus error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUS_ERROR</name>
                  <description>Last recorded error was a bus error on a source read</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SGE</name>
              <description>Scatter/Gather Configuration Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No scatter/gather configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>Last recorded error was a configuration error detected in the TCDn_DLAST_SGA field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NCE</name>
              <description>NBYTES/CITER Configuration Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No NBYTES/CITER configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>The last recorded error was NBYTES equal to zero or a CITER not equal to BITER error</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DOE</name>
              <description>Destination Offset Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No destination offset configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>Last recorded error was a configuration error detected in the TCDn_DOFF field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DAE</name>
              <description>Destination Address Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No destination address configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>Last recorded error was a configuration error detected in the TCDn_DADDR field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOE</name>
              <description>Source Offset Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No source offset configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>Last recorded error was a configuration error detected in the TCDn_SOFF field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SAE</name>
              <description>Source Address Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_ERROR</name>
                  <description>No source address configuration error</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIGURATION_ERROR</name>
                  <description>Last recorded error was a configuration error detected in the TCDn_SADDR field</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ECX</name>
              <description>Transfer Canceled</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CANCELED_TRANSFERS</name>
                  <description>No canceled transfers</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CANCELED_TRANSFER</name>
                  <description>Last recorded entry was a canceled transfer by the error cancel transfer input</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERRCHN</name>
              <description>Error Channel Number or Canceled Channel Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VLD</name>
              <description>Valid</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_FIELD_SET_ONE</name>
                  <description>No CHn_ES[ERR] fields are set to 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ATLEAST_ONE_FIELD</name>
                  <description>At least one CHn_ES[ERR] field is set to 1, indicating a valid error exists that software has not cleared</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MP_INT</name>
          <description>Management Page Interrupt Request Status</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Request Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
